;	=======================
;	 INCINERATORS
;	-----------------------

[IRI_FireSparkFlamethrower X2AbilityTemplate]
LocFriendlyName="Incinerate"
LocLongDescription="Set everything in the target cone aflame."
LocHelpText="Set everything in the target cone aflame."

[IRI_FireSparkFlamethrowerOverwatch X2AbilityTemplate]
LocFriendlyName="Incinerate"
LocLongDescription="Set everything in the target cone aflame."
LocHelpText="Set everything in the target cone aflame."

[IRI_Incinerator_CV X2WeaponTemplate]
FriendlyName="SF-01 Incinerator"
FriendlyNamePlural="SF-01 Incinerators"
BriefSummary="Originally designed by Dr. Claus of the first XCOM project in 2015, the \"Incinerator\" was meant to be mounted on a heavy armored vehicle. Its principle of operation is the same as for any other common flamethrower, but the increased size and pressure allow it to engulf any targeted area in an inferno of flames."
TacticalText="Originally designed by Dr. Claus of the first XCOM project in 2015, the \"Incinerator\" was meant to be mounted on a heavy armored vehicle. Its principle of operation is the same as for any other common flamethrower, but the increased size and pressure allow it to engulf any targeted area in an inferno of flames.<br/><bullet/> Targets immune to fire cannot be damaged by this weapon.<br/><bullet/> Both regular and Overwatch attack cover a cone-shaped area. This weapon must be handled carefully in proximity to allied units and sensitive objects."
AbilityDescName="incinerator"

[IRI_Incinerator_MG X2WeaponTemplate]
FriendlyName="SF-21 Ashbringer"
FriendlyNamePlural="SF-21 Ashbringers"
BriefSummary="\"Ashbringer's\" key parts are manufactured from alien alloys, allowing them to withstand greater pressure and temperature, making it possible to unleash a flamestorm of fire."
TacticalText="\"Ashbringer's\" key parts are manufactured from alien alloys, allowing them to withstand greater pressure and temperature, making it possible to unleash a flamestorm of fire.<br/><bullet/> Targets immune to fire cannot be damaged by this weapon.<br/><bullet/> Both regular and Overwatch attack cover a cone-shaped area. This weapon must be handled carefully in proximity to allied units and sensitive objects."
AbilityDescName="incinerator"

[IRI_Incinerator_BM X2WeaponTemplate]
FriendlyName="SF-35 Solar Flare"
FriendlyNamePlural="SF-35 Solar Flares"
BriefSummary="\"Solar Flare\" fires a stream of superheated ionized gas which can bring apocalyptic levels of destruction to any targeted area."
TacticalText="\"Solar Flare\" fires a stream of superheated ionized gas which can bring apocalyptic levels of destruction to any targeted area.<br/><bullet/> Targets immune to fire cannot be damaged by this weapon.<br/><bullet/> Both regular and Overwatch attack cover a cone-shaped area. This weapon must be handled carefully in proximity to allied units and sensitive objects."
AbilityDescName="incinerator"

;	============
;	 SABOT AMMO
;	------------
[IRI_Ammo_Sabot X2AmmoTemplate]
FriendlyName="Sabot Rounds"
FriendlyNamePlural="Sabot Rounds"
BriefSummary="These arrow-shaped sub-caliber rounds use discarding sabot to accelerate to hypersonic speeds, making them vastly more effective at long range, and harder for enemies to avoid."
TacticalText="These arrow-shaped sub-caliber rounds use discarding sabot to accelerate to hypersonic speeds, making them vastly more effective at long range, and harder for enemies to avoid.<br/><bullet> Squadsight penalties to Aim and Crit are reduced by <Ability:IRI_SABOT_AMMO_COUNTER_SQUADSIGHT/>.<br/><bullet> <Ability:IRI_SABOT_AMMO_COUNTER_DODGE/> of the target's natural Dodge is ignored.<br><Bullet/> <Ability:IRI_SABOT_AMMO_COUNTER_DEFENSE/> of the target's natural Defense is ignored. <br><Bullet/> Squadsight normally applies <Ability:IRI_SABOT_AMMO_SQUADSIGHT_AIM/> Aim penalty per tile and <Ability:IRI_SABOT_AMMO_SQUADSIGHT_CRIT/> Crit penalty."

[IRI_Ammo_Sabot_Ability X2AbilityTemplate]
LocFriendlyName="Sabot Rounds"
LocLongDescription="These arrow-shaped sub-caliber rounds use discarding sabot to accelerate to hypersonic speeds, making them vastly more effective at long range, and harder for enemies to avoid."
LocHelpText="These arrow-shaped sub-caliber rounds use discarding sabot to accelerate to hypersonic speeds, making them vastly more effective at long range, and harder for enemies to avoid."
LocFlyOverText="Sabot Rounds"

;	=======================
;	 ARTILLERY CANNONS
;	-----------------------

[IRI_ArtilleryCannon_CV X2WeaponTemplate]
FriendlyName="T-17 Arkhangel Heavy Cannon"
FriendlyNamePlural="T-17 Arkhangel Heavy Cannons"
BriefSummary="Prototyped in the city of Arkhangelsk in late 2015, the T-17 Heavy Cannon 45mm portable artillery piece was intended to be a heavy anti-armor mount for the S.H.I.V."
TacticalText="Prototyped in the city of Arkhangelsk in late 2015, the T-17 Heavy Cannon 45mm portable artillery piece was intended to be a heavy anti-armor mount for the S.H.I.V.<br/><bullet/> Kinetic projectiles fired by the Heavy Cannon can punch through cover, suffering a <Ability:IRI_HEAVY_CANNON_LOW_COVER_DAMAGE_PENALTY/>/<Ability:IRI_HEAVY_CANNON_HIGH_COVER_DAMAGE_PENALTY/> damage penalty instead of an Aim penalty.<br/><bullet/> Heavy Cannons must be reloaded after each shot and they take 2 Action Points to fire.<br/><bullet/> Heavy Cannon's tactical flexibility can be potentially improved by carrying special shell types.<br/><bullet/> All Heavy Cannon attacks benefit from special ammo."
AbilityDescName="heavy cannon"

[IRI_ArtilleryCannon_MG X2WeaponTemplate]
FriendlyName="LAGO-508 Heavy Cannon"
FriendlyNamePlural="LAGO-508 Heavy Cannons"
BriefSummary="Linear Acceleration Gauss Onager is the latest and greatest in the field of large caliber magnetic weapons."
TacticalText="Linear Acceleration Gauss Onager is the latest and greatest in the field of large caliber magnetic weapons.<br/><bullet/> Kinetic projectiles fired by the Heavy Cannon can punch through cover, suffering a <Ability:IRI_HEAVY_CANNON_LOW_COVER_DAMAGE_PENALTY/>/<Ability:IRI_HEAVY_CANNON_HIGH_COVER_DAMAGE_PENALTY/> damage penalty instead of an Aim penalty.<br/><bullet/> Heavy Cannons must be reloaded after each shot and they take 2 Action Points to fire.<br/><bullet/> Heavy Cannon's tactical flexibility can be potentially improved by carrying special shell types.<br/><bullet/> All Heavy Cannon attacks benefit from special ammo."
AbilityDescName="heavy cannon"

[IRI_ArtilleryCannon_BM X2WeaponTemplate]
FriendlyName="L-22 Leafstar Heavy Cannon"
FriendlyNamePlural="L-22 Leafstar Heavy Cannons"
BriefSummary="Named after the star-shaped pattern of its muzzle flash, the Leafstar Cannon fires balls of condensed volatile plasma."
TacticalText="Named after the star-shaped pattern of its muzzle flash, the Leafstar Cannon fires balls of condensed volatile plasma.<br/><bullet/> Plasma projectiles fired by the Heavy Cannon can burn through cover, suffering a <Ability:IRI_HEAVY_CANNON_LOW_COVER_DAMAGE_PENALTY/>/<Ability:IRI_HEAVY_CANNON_HIGH_COVER_DAMAGE_PENALTY/> damage penalty instead of an Aim penalty.<br/><bullet/> Heavy Cannons must be reloaded after each shot and they take 2 Action Points to fire.<br/><bullet/> Heavy Cannon's tactical flexibility can be potentially improved by carrying special shell types.<br/><bullet/> All Heavy Cannon attacks benefit from special ammo."
AbilityDescName="heavy cannon"

;	=======================
;	 CANNON SHELL PASSIVES
;	-----------------------

;	=====================================================================================================
;	Used for localization and icon in tactical to remind the player that cannon can shoot through cover.

[IRI_FireArtilleryCannon_AP_Passive X2AbilityTemplate]
LocFriendlyName="Heavy Cannon"
LocLongDescription="Regular Heavy Cannon shells can punch through cover, suffering a <Ability:IRI_HEAVY_CANNON_LOW_COVER_DAMAGE_PENALTY/>/<Ability:IRI_HEAVY_CANNON_HIGH_COVER_DAMAGE_PENALTY/> damage penalty instead of an Aim penalty."
LocHelpText="Regular Heavy Cannon shells can punch through cover, suffering a <Ability:IRI_HEAVY_CANNON_LOW_COVER_DAMAGE_PENALTY/>/<Ability:IRI_HEAVY_CANNON_HIGH_COVER_DAMAGE_PENALTY/> damage penalty instead of an Aim penalty."
LocFlyOverText="Heavy Cannon"

;	=====================================================================================================
;	Not actually visible in game

[IRI_FireArtilleryCannon_HEAT_Passive X2AbilityTemplate]
LocFriendlyName="Carrying HEAT Shells"
LocLongDescription="This unit is carrying High Explosive Anti Tank shells that can be fired from a Heavy Cannon. HEAT shells deal high armor piercing damage to a single target, and minor explosive damage to adjacent enemies. HEAT shells suffer a crit chance penalty when engaging enemies at squadsight ranges."
LocHelpText="This unit is carrying High Explosive Anti Tank shells that can be fired from a Heavy Cannon. HEAT shells deal high armor piercing damage to a single target, and minor explosive damage to adjacent enemies. HEAT shells suffer a crit chance penalty when engaging enemies at squadsight ranges."
LocFlyOverText="HEAT Shells"

[IRI_FireArtilleryCannon_HE_Passive X2AbilityTemplate]
LocFriendlyName="Carrying HE Shells"
LocLongDescription="This unit is carrying High Explosive shells that can be fired from a Heavy Cannon. HE shells fly on an arched trajectory and deal explosive damage to all enemies in a target area."
LocHelpText="This unit is carrying High Explosive shells that can be fired from a Heavy Cannon. HE shells fly on an arched trajectory and deal explosive damage to all enemies in a target area."
LocFlyOverText="HE Shells"

[IRI_FireArtilleryCannon_Shrapnel_Passive X2AbilityTemplate]
LocFriendlyName="Carrying Shrapnel Shells"
LocLongDescription="This unit is carrying Shrapnel shells that can be fired from a Heavy Cannon. Shrapnel Shells deal damage to all targets in a cone. Shrapnel is blocked by cover."
LocHelpText="This unit is carrying Shrapnel shells that can be fired from a Heavy Cannon. Shrapnel Shells deal damage to all targets in a cone. Shrapnel is blocked by cover."
LocFlyOverText="Shrapnel Shells"

;	=====================================================================================================
;	Used for localization and icon in tactical to remind the player that this unit carries specific shells

[IRI_Shell_HEAT_Passive X2AbilityTemplate]
LocFriendlyName="Carrying HEAT Shells"
LocLongDescription="This unit is carrying High Explosive Anti Tank shells that can be fired from a Heavy Cannon. HEAT shells deal high armor piercing damage to a single target, and minor explosive damage to adjacent enemies. HEAT shells suffer a crit chance penalty when engaging enemies at squadsight ranges, unless Sabot Rounds are equipped."
LocHelpText="This unit is carrying High Explosive Anti Tank shells that can be fired from a Heavy Cannon. HEAT shells deal high armor piercing damage to a single target, and minor explosive damage to adjacent enemies. HEAT shells suffer a crit chance penalty when engaging enemies at squadsight ranges, unless Sabot Rounds are equipped."
LocFlyOverText="HEAT Shells"

[IRI_Shell_HEDP_Passive X2AbilityTemplate]
LocFriendlyName="Carrying HEDP Shells"
LocLongDescription="This unit is carrying High Explosive Dual Purpose shells that can be fired from a Heavy Cannon. HEDP shells deal high armor piercing damage to a single target, and moderate explosive damage to adjacent enemies. HEDP shells suffer a crit chance penalty when engaging enemies at squadsight ranges, unless Sabot Rounds are equipped."
LocHelpText="This unit is carrying High Explosive Dual Purpose shells that can be fired from a Heavy Cannon. HEDP shells deal high armor piercing damage to a single target, and moderate explosive damage to adjacent enemies. HEDP shells suffer a crit chance penalty when engaging enemies at squadsight ranges, unless Sabot Rounds are equipped."
LocFlyOverText="HEDP Shells"

[IRI_Shell_HEAT_Passive X2AbilityTemplate]
LocFriendlyName="Carrying HEAT Shells"
LocLongDescription="This unit is carrying High Explosive Anti Tank shells that can be fired from a Heavy Cannon. HEAT shells deal high armor piercing damage to a single target, and minor explosive damage to adjacent enemies. HEAT shells suffer a crit chance penalty when engaging enemies at squadsight ranges, unless Sabot Rounds are equipped."
LocHelpText="This unit is carrying High Explosive Anti Tank shells that can be fired from a Heavy Cannon. HEAT shells deal high armor piercing damage to a single target, and minor explosive damage to adjacent enemies. HEAT shells suffer a crit chance penalty when engaging enemies at squadsight ranges, unless Sabot Rounds are equipped."
LocFlyOverText="HEAT Shells"

[IRI_Shell_HE_Passive X2AbilityTemplate]
LocFriendlyName="Carrying HE Shells"
LocLongDescription="This unit is carrying High Explosive shells that can be fired from a Heavy Cannon. HE shells fly on an arched trajectory and deal explosive damage to all enemies in a target area."
LocHelpText="This unit is carrying High Explosive shells that can be fired from a Heavy Cannon. HE shells fly on an arched trajectory and deal explosive damage to all enemies in a target area."
LocFlyOverText="HE Shells"

[IRI_Shell_HESH_Passive X2AbilityTemplate]
LocFriendlyName="Carrying HESH Shells"
LocLongDescription="This unit is carrying High Explosive Squash Head shells that can be fired from a Heavy Cannon. HESH shells fly on an arched trajectory and deal explosive damage to all enemies in a target area. Target at the center of the explosion will take increased damage."
LocHelpText="This unit is carrying High Explosive Squash Head shells that can be fired from a Heavy Cannon. HESH shells fly on an arched trajectory and deal explosive damage to all enemies in a target area. Target at the center of the explosion will take increased damage."
LocFlyOverText="HESH Shells"

[IRI_Shell_Shrapnel_Passive X2AbilityTemplate]
LocFriendlyName="Carrying Shrapnel Shells"
LocLongDescription="This unit is carrying Shrapnel shells that can be fired from a Heavy Cannon. Shrapnel Shells deal damage to all targets in a cone. Shrapnel is blocked by cover."
LocHelpText="This unit is carrying Shrapnel shells that can be fired from a Heavy Cannon. Shrapnel Shells deal damage to all targets in a cone. Shrapnel is blocked by cover."
LocFlyOverText="Shrapnel Shells"

[IRI_Shell_Flechette_Passive X2AbilityTemplate]
LocFriendlyName="Carrying Flechette Shells"
LocLongDescription="This unit is carrying Flechette shells that can be fired from a Heavy Cannon. Flechette Shells deal damage to all targets in a cone. Flechettes are blocked by cover, but they will pierce armor of organic enemies."
LocHelpText="This unit is carrying Flechette shells that can be fired from a Heavy Cannon. Flechette Shells deal damage to all targets in a cone. Flechettes are blocked by cover, but they will pierce armor of organic enemies."
LocFlyOverText="Flechette Shells"


;	============================
;	 EXPERIMENTAL CANNON SHELLS
;	----------------------------

[IRI_ExperimentalShells_Tech X2TechTemplate]
DisplayName="Experimental Heavy Cannon Shells"
Summary="With some time and resources, we could set up automated manufacturing lines for expanded ordnance nomenclature for Heavy Cannons, increasing their tactical flexibility."

[IRI_Shell_HEAT X2WeaponTemplate]
FriendlyName="HEAT Shells"
FriendlyNamePlural="HEAT Shells"
BriefSummary="High Explosive Anti Tank shells use a shaped explosive charge to generate enormous pressure to literally push through armor. Can be equipped only alongside a Heavy Cannon."
TacticalText="High Explosive Anti Tank shells use a shaped explosive charge to generate enormous pressure to literally push through armor. Can be equipped only alongside a Heavy Cannon.<br/><bullet/> HEAT shells are highly effective against armored targets, and the explosion deals minor damage to adjacent targets.<br/><bullet/> HEAT shells deal the same damage regardless of distance, however they fly much slower, so the likelihood of scoring hits on enemy weak points is reduced as the distance to the target grows, unless Sabot Rounds are equipped.<br/><bullet/> Special shells are carried in the Auxiliary Weapon slot and they benefit from special ammo."

[IRI_Shell_HE X2WeaponTemplate]
FriendlyName="HE Shells"
FriendlyNamePlural="HE Shells"
BriefSummary="High Explosive shells fly on an arched trajectory and deal moderate blast damage to targets around the impact point. Can be equipped only alongside a Heavy Cannon."
TacticalText="High Explosive shells fly on an arched trajectory and deal moderate blast damage to targets around the impact point. Can be equipped only alongside a Heavy Cannon.<br/><bullet/> Special shells are carried in the Auxiliary Weapon slot and they benefit from special ammo."

[IRI_Shell_Shrapnel X2WeaponTemplate]
FriendlyName="Shrapnel Shells"
FriendlyNamePlural="Shrapnel Shells"
BriefSummary="Shrapnel Shells fire a barrage of shrapnel that deals moderate damage to targets in a cone. Shrapnel is blocked by cover. Can be equipped only alongside a Heavy Cannon."
TacticalText="Shrapnel Shells fire a barrage of shrapnel that deals moderate damage to targets in a cone. Shrapnel is blocked by cover. Can be equipped only alongside a Heavy Cannon.<br/><bullet/> Special shells are carried in the Auxiliary Weapon slot and they benefit from special ammo."

[IRI_FireArtilleryCannon_HEAT X2AbilityTemplate]
LocFriendlyName="Fire HEAT Shell"
LocLongDescription="Fire HEAT Shell at a target."
LocHelpText="Fire HEAT Shell at a target."

[IRI_FireArtilleryCannon_HE X2AbilityTemplate]
LocFriendlyName="Fire HE Shell"
LocLongDescription="Fire HE Shell at a target area."
LocHelpText="Fire HE Shell at a target area."

[IRI_FireArtilleryCannon_Shrapnel X2AbilityTemplate]
LocFriendlyName="Fire Shrapnel Shell"
LocLongDescription="Fire Shrapnel Shell at a target area."
LocHelpText="Fire Shrapnel Shell at a target area."

;	========================
;	 IMPROVED CANNON SHELLS
;	------------------------
[IRI_ImprovedShells_Tech X2TechTemplate]
DisplayName="Improved Heavy Cannon Shells"
Summary="Upgrade and revise our entire arsenal of special Heavy Cannon shells to improve them wherever possible."

[IRI_Shell_HEDP X2WeaponTemplate]
FriendlyName="HEDP Shells"
FriendlyNamePlural="HEDP Shells"
BriefSummary="High Explosive Dual Purpose shells are essentially HEAT shells with reinforced outer layer for increased fragmentation. Can be equipped only alongside a Heavy Cannon."
TacticalText="High Explosive Dual Purpose shells are essentially HEAT shells with reinforced outer layer for increased fragmentation. Can be equipped only alongside a Heavy Cannon.<br/><bullet/> HEDP shells deal more damage to adjacent targets, which makes them highly versatile.<br/><bullet/> Special shells are carried in the Auxiliary Weapon slot and they benefit from special ammo."

[IRI_Shell_HESH X2WeaponTemplate]
FriendlyName="HESH Shells"
FriendlyNamePlural="HESH Shells"
BriefSummary="High Explosive Squash Head shells use a malleable plastic explosive warhead that squashes against the impact surface just before detonation, significantly increasing damage done to the object in the epicenter of the explosion. Can be equipped only alongside a Heavy Cannon."
TacticalText="High Explosive Squash Head shells use a malleable plastic explosive warhead that squashes against the impact surface just before detonation, significantly increasing damage done to the object in the epicenter of the explosion. Can be equipped only alongside a Heavy Cannon.<br/><bullet/> HESH shells deal more damage to the target at the center of the explosion than regular HE shells.<br/><bullet/> Special shells are carried in the Auxiliary Weapon slot and they benefit from special ammo."

[IRI_Shell_Flechette X2WeaponTemplate]
FriendlyName="Flechette Shells"
FriendlyNamePlural="Flechette Shells"
BriefSummary="Flechette Shells are essentially shrapnel shells with the shrapnel payload replaced by sharpened alloy flechettes that pierce armor of organic units. Flechettes are blocked by cover. Can be equipped only alongside a Heavy Cannon."
TacticalText="Flechette Shells are essentially shrapnel shells with the shrapnel payload replaced by sharpened alloy flechettes that pierce armor of organic units. Flechettes are blocked by cover. Can be equipped only alongside a Heavy Cannon.<br/><bullet/> Special shells are carried in the Auxiliary Weapon slot and they benefit from special ammo."

[IRI_FireArtilleryCannon_HEDP X2AbilityTemplate]
LocFriendlyName="Fire HEDP Shell"
LocLongDescription="Fire HEDP Shell at a target."
LocHelpText="Fire HEDP Shell at a target."

[IRI_FireArtilleryCannon_HESH X2AbilityTemplate]
LocFriendlyName="Fire HESH Shell"
LocLongDescription="Fire HESH Shell at a target area. Target at the epicenter of the explosion will take more damage."
LocHelpText="Fire HESH Shell at a target area."

[IRI_FireArtilleryCannon_Flechette X2AbilityTemplate]
LocFriendlyName="Fire Flechette Shell"
LocLongDescription="Fire Flechette Shell at a target area. Armor of organic units will be pierced."
LocHelpText="Fire Flechette Shell at a target area."

;	========================
;	 MUNITIONS MOUNT
;	------------------------
[IRI_Shells_T1 X2WeaponTemplate]
FriendlyName="Munitions Mount"
FriendlyNamePlural="Munitions Mounts"
BriefSummary="Equipped as a secondary weapon, Munitions Mount grants an Ammo Slot and includes HEAT Shells, HE Shells and Shrapnel Shells at the same time. Can be equipped only alongside a Heavy Cannon."
TacticalText="Equipped as a secondary weapon, Munitions Mount grants an Ammo Slot and includes HEAT Shells, HE Shells and Shrapnel Shells at the same time. Can be equipped only alongside a Heavy Cannon."

[IRI_Shells_T2 X2WeaponTemplate]
FriendlyName="Advanced Munitions Mount"
FriendlyNamePlural="Advanced Munitions Mounts"
BriefSummary="Equipped as a secondary weapon, Advanced Munitions Mount grants an Ammo Slot and includes HEDP Shells, HESH Shells and Flechette Shells at the same time. Can be equipped only alongside a Heavy Cannon."
TacticalText="Equipped as a secondary weapon, Advanced Munitions Mount grants an Ammo Slot and includes HEDP Shells, HESH Shells and Flechette Shells at the same time. Can be equipped only alongside a Heavy Cannon."

;	========================
;	WEAPON UPGRADES
;	------------------------

;[IRI_ExperimentalMagazine_Passive X2AbilityTemplate]
;LocFriendlyName="Experimental Magazine"
;LocLongDescription="This unit is carrying a weapon that has been upgraded with an Experimental Magazine so it can be loaded with special ammo."
;LocHelpText="This unit is carrying a weapon that has been upgraded with an Experimental Magazine so it can be loaded with special ammo."
;LocFlyOverText="Experimental Magazine"

[IRI_ExperimentalMagazine_Upgrade X2WeaponUpgradeTemplate]
FriendlyName="Experimental Magazine"
FriendlyNamePlural="Experimental Magazines"
BriefSummary="Grants an Ammo Slot."
TinySummary="Grants an Ammo Slot."
LootTooltip="This weapon upgrade will allow equipping special ammo without occupying a utility slot. It will have no effect if the unit already has an Ammo Slot."

[IRI_SpeedLoader_Passive X2AbilityTemplate]
LocFriendlyName="Speed Loader"
LocLongDescription="This unit carries a weapon equipped with a Speed Loader, they will reload that weapon automatically when performing a dash."
LocHelpText="This unit carries a weapon equipped with a Speed Loader, they will reload that weapon automatically when performing a dash."
LocFlyOverText="Speed Loader"

[IRI_SpeedLoader_Reload X2AbilityTemplate]
LocFriendlyName="Speed Loader"
LocLongDescription="Reload the weapon automatically when performing a dash."
LocHelpText="This unit carries a weapon equipped with a Speed Loader, they will reload that weapon automatically when performing a dash."
LocFlyOverText="Speed Loader"

[IRI_SpeedLoader_Upgrade X2WeaponUpgradeTemplate]
FriendlyName="Speed Loader"
FriendlyNamePlural="Speed Loaders"
BriefSummary="Reload automatically when dashing."
TinySummary="Dashing reloads weapon."
LootTooltip="This weapon upgrade automatically reloads the weapon when performing a dash."

;	========================
;	OTHER STUFF
;	------------------------

[IRI_Arsenal_DummyPassive X2AbilityTemplate]
LocFriendlyName="Arsenal"
LocLongDescription="The BIT can equip and use heavy weapons. If used on an allied soldier, Aid Protocol will temporarily transfer control over these weapons to them. BIT can also be used for the same Protocol duties as GREMLINs, but it's less effective in that role."
LocHelpText="The BIT can equip and use heavy weapons. If used on an allied soldier, Aid Protocol will temporarily transfer control over these weapons to them. BIT can also be used for the same Protocol duties as GREMLINs, but it's less effective in that role."

[IRI_EntrenchProtocol X2AbilityTemplate]
LocFriendlyName="Entrench Protocol"
LocLongDescription="If this unit uses Aid Protocol on self, its effects will last indefinitely as long as the unit doesn't move. Aid Protocol does not begin its cooldown during Entrench Protocol."
LocHelpText="If this unit uses Aid Protocol on self, its effects will last indefinitely as long as the unit doesn't move. Aid Protocol does not begin its cooldown during Entrench Protocol."
LocFlyOverText="Entrench Protocol"

[IRI_EntrenchProtocol_Passive X2AbilityTemplate]
LocFriendlyName="Protocol Suite"
LocLongDescription="Hack increased by +<Ability:IRI_PROTOCOL_SUITE_HACKING_BONUS/>. If equipped with a GREMLIN or BIT, this unit will gain additional abilities:\n<bullet/><font color='#1ad1cf'>Intrusion Protocol</font> - hack security towers and objectives.\n<bullet/><font color='#1ad1cf'>Aid Protocol</font> - grant bonus Defense to an ally.\n<bullet/><font color='#1ad1cf'>Entrench Protocol</font> - extend duration of Aid Protocol used on self while not moving.\n<bullet/><font color='#1ad1cf'>Active Camo</font> - reduce detection range while in concealment."
LocHelpText="Hack increased by +<Ability:IRI_PROTOCOL_SUITE_HACKING_BONUS/>. If equipped with a GREMLIN or BIT, this unit will gain Intrusion Protocol, Aid Protocol, Entrench Protocol and Active Camo."
LocPromotionPopupText="<Bullet/> Entrench Protocol passively makes Aid Protocol last indefinitely if used on self, as long as this unit doesn't move. Aid Protocol does not begin its cooldown during Entrench Protocol.<br/><Bullet/> Active Camo reduces this unit's Detection Radius to be closer to our regular soldiers. Without Active Camo granted by a GREMLIN or a BIT, this unit is much easier to notice while in concealment."

[IRI_ActiveCamo X2AbilityTemplate]
LocFriendlyName="Active Camo"
LocLongDescription="At the start of the mission, BIT or GREMLIN projects a light-bending field around the unit, reducing unit's detection radius."
LocHelpText="At the start of the mission, BIT or GREMLIN projects a light-bending field around the unit, reducing unit's detection radius."
LocFlyOverText="Active Camo"

[IRI_OrdnanceLauncher_CV X2GrenadeLauncherTemplate]
FriendlyName="Ordnance Launcher"
FriendlyNamePlural="Ordnance Launchers"
BriefSummary="Ordnance Launcher allows our mechanized units to field a variety of explosive munitions."
TacticalText="Ordnance Launcher allows our mechanized units to field a variety of explosive munitions.\n<Bullet/> Grants <Ability:IRI_CONV_LAUNCHER_GRANT_GRENADE_SLOTS/> Grenade-only slots."
AbilityDescName="ordnance launcher"

[IRI_OrdnanceLauncher_MG X2GrenadeLauncherTemplate]
FriendlyName="Ordnance Accelerator"
FriendlyNamePlural="Ordnance Accelerators"
BriefSummary="Ordnance Accelerator uses magnetic technology to propel explosive munitions further than our conventional launcher."
TacticalText="Ordnance Accelerator uses magnetic technology to propel explosive munitions further than our conventional launcher.\n<Bullet/> Grants <Ability:IRI_MAG_LAUNCHER_GRANT_GRENADE_SLOTS/> Grenade-only slots."
AbilityDescName="ordnance launcher"

[IRI_OrdnanceLauncher_BM X2GrenadeLauncherTemplate]
FriendlyName="Ordnance Amplifier"
FriendlyNamePlural="Ordnance Amplifiers"
BriefSummary="Ordnance Amplifier combines our latest breakthroughs in beam technology-based propulsion and AI-assisted targeting systems to deliver payloads with unprecedented precision."
TacticalText="Ordnance Amplifier combines our latest breakthroughs in beam technology-based propulsion and AI-assisted targeting systems to guide the payload around obstacles to ensure maximum target impact.\n<Bullet/> Grants <Ability:IRI_BEAM_LAUNCHER_GRANT_GRENADE_SLOTS/> Grenade-only slots."
AbilityDescName="ordnance launcher"


[IRI_KineticStrikeModule X2WeaponTemplate]
FriendlyName="Kinetic Strike Module"
FriendlyNamePlural="Kinetic Strike Modules"
BriefSummary="Kinetic Strike Module is an arm-mounted alloy brass knuckle with solid-fuel rocket boosters that significantly increases the effectiveness of our mechanized units in close quarters combat."
TacticalText="Kinetic Strike Module is an arm-mounted alloy brass knuckle with solid-fuel rocket boosters that significantly increases the effectiveness of our mechanized units in close quarters combat."
AbilityDescName="kinetic strike module"

[IRI_KineticStrike X2AbilityTemplate]
LocFriendlyName="Kinetic Strike"
LocLongDescription="Deliver a devastating strike to a target on an adjacent tile. Destroys most cover objects."
LocHelpText="Deliver a devastating strike to a target on an adjacent tile. Destroys most cover objects."
LocFlyOverText="Kinetic Strike"

[IRI_KineticStrike_Passive X2AbilityTemplate]
LocFriendlyName="Kinetic Drivers"
LocLongDescription="Kinetic Strike Module significantly increases damage of melee attacks."
LocHelpText="Kinetic Strike Module significantly increases damage of melee attacks."
;LocFlyOverText="Kinetic Drivers"


[IRI_RestorativeMist_Heal X2AbilityTemplate]
LocFriendlyName="Restorative Mist"
LocLongDescription="Heal all organic units around you."
LocHelpText="Heal all organic units around you."
LocFlyOverText="Restorative Mist"

[IRI_RestorativeMist_HealBit X2AbilityTemplate]
LocFriendlyName="Restorative Mist"
LocLongDescription="Command the BIT to heal all organic units in a target area."
LocHelpText="Command the BIT to heal all organic units in a target area."
LocFlyOverText="Restorative Mist"

[IRI_RestorativeMist_CV X2WeaponTemplate]
FriendlyName="Restorative Mist"
FriendlyNamePlural="Restorative Mist"
BriefSummary="Essentially an oversized Medikit, the Restorative Mist module is capable of healing multiple organic units at once. Carried as a Heavy Weapon. Can be deployed remotely if equipped on a BIT."
TacticalText="Essentially an oversized Medikit, the Restorative Mist module is capable of healing multiple organic units at once. Carried as a Heavy Weapon. Can be deployed remotely if equipped on a BIT.<br/><Bullet/> The dispersed healing solution is capable of treating wounds and removing a variety of adverse conditions, including burns and poison.<br/><Bullet/> The employed dispersion mechanism lacks precision, and therefore cannot be used to stabilize bleeding out units.<br/><Bullet/> If a BIT is equipped, it can be used to disperse the Restorative Mist in a target area, making it possible to heal distant units."
AbilityDescName="restorative mist"


[IRI_ElectroPulse X2AbilityTemplate]
LocFriendlyName="E.M. Pulse"
LocLongDescription="Emit an E.M. Pulse to disable weapons and Energy Shields, and to shut down robotic units around you."
LocHelpText="Emit an E.M. Pulse to disable weapons and Energy Shields, and to shut down robotic units around you."
LocFlyOverText="E.M. Pulse"

[IRI_ElectroPulse_Bit X2AbilityTemplate]
LocFriendlyName="E.M. Pulse"
LocLongDescription="Command the BIT to emit an E.M. Pulse to disable weapons and Energy Shields, and to shut down robotic units in a target area."
LocHelpText="Command the BIT to emit an E.M. Pulse to disable weapons and Energy Shields, and to shut down robotic units in a target area."
LocFlyOverText="E.M. Pulse"

[IRI_ElectroPulse_CV X2WeaponTemplate]
FriendlyName="E.M. Pulse"
FriendlyNamePlural="E.M. Pulse"
BriefSummary="This module is capable of emitting electro-magnetic pulses that will temporarily shut down robotic units in an area. It will also disable Energy Shields of all affected units, and disable their weapons, forcing them to reload. Carried as a Heavy Weapon. Can be deployed remotely if equipped on a BIT."
TacticalText="This module is capable of emitting electro-magnetic pulses that will temporarily shut down robotic units in an area. It will also disable Energy Shields of all affected units, and disable their weapons, forcing them to reload. Carried as a Heavy Weapon. Can be deployed remotely if equipped on a BIT.<br/><Bullet/> The unit carrying the E.M. Pulse module is immune to the effects of their own EMP, but other allied units caught in the area will be affected.<br/><Bullet/> If a BIT is equipped, it can be used to discharge the E.M. Pulse in a target area, making it possible to affect distant units."
AbilityDescName="e.m. pulse"

;	========================
;	 HEAVY STRIKE MODULE
;	------------------------

[IRI_KineticStrike_Soldier X2AbilityTemplate]
LocFriendlyName="Heavy Strike"
LocLongDescription="Deliver a devastating strike to a target on an adjacent tile. Destroys most cover objects."
LocHelpText="Deliver a devastating strike to a target on an adjacent tile. Destroys most cover objects."
LocFlyOverText="Heavy Strike"

[IRI_HeavyStrikeModule_T1 X2WeaponTemplate]
FriendlyName="Heavy Strike Module"
FriendlyNamePlural="Heavy Strike Modules"
BriefSummary="Designed to be mounted as a Heavy Weapon onto our exoskeletal suits, Heavy Strike Module allows its wielder to break through enemies and walls alike."
TacticalText="Designed to be mounted as a Heavy Weapon onto our exoskeletal suits, Heavy Strike Module allows its wielder to break through enemies and walls alike."
AbilityDescName="heavy strike module"

[IRI_HeavyStrikeModule_T2 X2WeaponTemplate]
FriendlyName="Powered Strike Module"
FriendlyNamePlural="Powered Strike Modules"
BriefSummary="Powered Strike Module is able to draw more power from the Heavy Weapons mount to deliver devastating strikes to adjacent enemies and objects."
TacticalText="Powered Strike Module is able to draw more power from the Heavy Weapons mount to deliver devastating strikes to adjacent enemies and objects."
AbilityDescName="powered strike module"

[IRI_HeavyStrike_Bit X2AbilityTemplate]
LocFriendlyName="BIT Heavy Strike"
LocLongDescription="Command your BIT to deliver a devastating strike to a target on a target tile. Destroys most cover objects."
LocHelpText="Command your BIT to deliver a devastating strike to a target on a target tile. Destroys most cover objects."
LocFlyOverText="BIT Heavy Strike"

;	========================
;	 KIRUKA AUTOGUN
;	------------------------

[IRI_Heavy_Autogun X2WeaponTemplate]
FriendlyName="Kiruka Autogun"
FriendlyNamePlural="Kiruka Autoguns"
BriefSummary="Designed by Kiruka Firearms, the Autogun is meant to be a backup weapon for our SPARK units, though regular soldiers are capable of using them as well."
TacticalText="Designed by Kiruka Firearms, the Autogun is meant to be a backup weapon for our SPARK units, though regular soldiers are capable of using them as well.<br/><Bullet/> The large ammo supply makes the Autogun indispensable in a target-saturated environment.<br/><Bullet/> Hollowpoint slugs fired by the Autogun quickly lose energy and deal very little environmental damage.<br/><Bullet/> Soldiers with special training are capable of firing the Autogun without ending turn.<br/><Bullet/> Autogun attacks benefit from special ammo."
AbilityDescName="autogun"

[IRI_Heavy_Autogun_MK2 X2WeaponTemplate]
FriendlyName="Kiruka Autopulser"
FriendlyNamePlural="Kiruka Autopulsers"
BriefSummary="Improved with some early concept pulse beam tech, the Autopulser deals more damage than regular Kiruka Autoguns."
TacticalText="Improved with some early concept pulse beam tech, the Autopulser deals more damage than regular Kiruka Autoguns.<br/><Bullet/> The large ammo supply makes the Autopulser indispensable in a target-saturated environment.<br/><Bullet/> Low frequency pulse beams fired by the Autopulser deal very little environmental damage.<br/><Bullet/> Soldiers with special training are capable of firing the Autopulser without ending turn.<br/><Bullet/> Autopulser attacks benefit from special ammo."
AbilityDescName="autopulser"

[IRI_Fire_HeavyAutogun X2AbilityTemplate]
LocFriendlyName="Fire Autogun"
LocLongDescription="Fire Kiruka Autogun at a target."
LocHelpText="Fire Kiruka Autogun at a target."

[IRI_Overwatch_HeavyAutogun X2AbilityTemplate]
LocFriendlyName="Autogun Overwatch"
LocLongDescription="Fire Kiruka Autogun on the first enemy that moves within your line of sight with a penalty to aim."
LocLongDescriptionWhenConcealed="Fire Kiruka Autogun on the first enemy that moves within your line of sight but only if revealed."
LocHelpText="Fire Kiruka Autogun on the first enemy that moves within your line of sight with a penalty to aim."
LocFlyOverText="Autogun Overwatch"
LocFriendlyNameWhenConcealed="Autogun Overwatch (Concealed)"

[IRI_OverwatchShot_HeavyAutogun X2AbilityTemplate]
LocFriendlyName="Fire Autogun"
LocLongDescription="Fire Kiruka Autogun at a target."
LocHelpText="Fire Kiruka Autogun at a target."

[IRI_OverwatchShot_HeavyAutogun_Spark X2AbilityTemplate]
LocFriendlyName="Fire Autogun"
LocLongDescription="Fire Kiruka Autogun at a target."
LocHelpText="Fire Kiruka Autogun at a target."

[IRI_OverwatchShot_HeavyAutogun_BIT X2AbilityTemplate]
LocFriendlyName="Fire Autogun"
LocLongDescription="Fire Kiruka Autogun at a target."
LocHelpText="Fire Kiruka Autogun at a target."

[IRI_Fire_HeavyAutogun_Spark X2AbilityTemplate]
LocFriendlyName="Fire Autogun"
LocLongDescription="Fire Kiruka Autogun at a target."
LocHelpText="Fire Kiruka Autogun at a target."

[IRI_Fire_HeavyAutogun_BIT X2AbilityTemplate]
LocFriendlyName="Fire Autogun"
LocLongDescription="Fire Kiruka Autogun at a target."
LocHelpText="Fire Kiruka Autogun at a target."

[IRI_ArmCannon_Tech X2TechTemplate]
DisplayName="Mechanized Arm Transformation Gears"
Summary="With a little bit of effort and resources, we could devise an arm transformation system that would allow our heavy mechanized units to carry an additional Heavy Weapon integrated into their left arm, carried in the Auxiliary Weapon slot."

[XComGame.UIArmory_Loadout]
[UIArmory_Loadout]
m_strInventoryLabels[eInvSlot_SparkGrenadePocket]="GRENADE"
m_strInventoryLabels[eInvSlot_AuxiliaryWeapon]="AUXILIARY WEAPON"
m_strInventoryLabels[eInvSlot_ExtraBackpack]="BIT HEAVY WEAPON"
